shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

sweets = {
    'печенье': [
        {'name': 'пятерочка', 'price': 9.99,
        'name': 'ашан', 'price': 10.99}
    ],
    'конфеты': [
        {'name': 'пятерочка', 'price': 32.99,
        'name': 'магнит', 'price': 30.99}
    ],
    'карамель': [
        {'name': 'ашан', 'price': 45.99,
        'name': 'магнит', 'price': 41.99}
    ],
    'пирожное': [
        {'name': 'пятерочка', 'price': 59.99,
        'name': 'магнит', 'price': 62.99}
    ]
}
